xzcvczx/mla-legacy/Graphics MultiApp Demo/Alternative Configurations/HardwareProfile_MULTI_MEDIA_BOARD_DM00123_8PMP_PIC32_ENET_STK_SSD1926_USBMSD_TFT_G240320LTSW_118W_E.h
	            // Definitions for RS pin
                #define DisplayCmdDataConfig()      TRISCCLR = _TRISC_TRISC2_MASK
                #define DisplaySetCommand()         LATCCLR = _LATC_LATC2_MASK
                #define DisplaySetData()            LATCSET = _LATC_LATC2_MASK

	            // Definitions for CS pin
                #define DisplayConfig()             TRISDCLR = _TRISD_TRISD10_MASK
                #define DisplayEnable()             LATDCLR = _LATD_LATD10_MASK
                #define DisplayDisable()            LATDSET = _LATD_LATD10_MASK

                // Definitions for FLASH CS pin
                #define DisplayFlashConfig()        TRISDCLR = _TRISD_TRISD1_MASK     
                #define DisplayFlashEnable()        LATDCLR = _LATD_LATD1_MASK
                #define DisplayFlashDisable()       LATDSET = _LATD_LATD1_MASK

                // Definitions for POWER ON pin
                #define DisplayPowerConfig()        TRISCCLR = _TRISC_TRISC3_MASK
                #define DisplayPowerOn()            LATCSET = _LATC_LATC3_MASK 
                #define DisplayPowerOff()           LATCCLR = _LATC_LATC3_MASK

                // Extended address lines
                #define DisplayAddr0Config()        TRISDCLR = _TRISD_TRISD3_MASK
                #define DisplaySetAddr0()           LATDCLR = _LATD_LATD3_MASK
                #define DisplayClearAddr0()         LATDSET = _LATD_LATD3_MASK

                #define DisplayAddr17Config()       TRISGCLR = _TRISD_TRISG14_MASK
                #define DisplaytSetAddr17()         LATGCLR = _LATD_LATG14_MASK
                #define DisplayClearAddr17()        LATGSET = _LATD_LATG14_MASK
            #endif

    #else
        #error GRAPHICS CONTROLLER IS NOT SUPPORTED
    #endif // (DISPLAY_CONTROLLER == ...
#elif defined (GFX_PICTAIL_V3)
    #if defined(__dsPIC33FJ128GP804__) || defined(__PIC24HJ128GP504__)

        // Definitions for reset pin
        #define DisplayResetConfig()        TRISAbits.TRISA4 = 0    
        #define DisplayResetEnable()        LATAbits.LATA4 = 0
        #define DisplayResetDisable()       LATAbits.LATA4 = 1

        // Definitions for RS pin
        #define DisplayCmdDataConfig()      TRISAbits.TRISA1 = 0
        #define DisplaySetCommand()         LATAbits.LATA1 = 0
        #define DisplaySetData()            LATAbits.LATA1 = 1

        // Definitions for CS pin
        #define DisplayConfig()             TRISBbits.TRISB15 = 0             
        #define DisplayEnable()             LATBbits.LATB15 = 0
        #define DisplayDisable()            LATBbits.LATB15 = 1

        // Definitions for FLASH CS pin
        #define DisplayFlashConfig()       
        #define DisplayFlashEnable()       
        #define DisplayFlashDisable()      

        // Definitions for POWER ON pin
        #define DisplayPowerConfig()       
        #define DisplayPowerOn()           
        #define DisplayPowerOff()          

    #else

        #ifndef __PIC32MX__
            // Definitions for reset pin
            #define DisplayResetConfig()        TRISCbits.TRISC1 = 0    
            #define DisplayResetEnable()        LATCbits.LATC1 = 0
            #define DisplayResetDisable()       LATCbits.LATC1 = 1

            // Definitions for RS pin
            #define DisplayCmdDataConfig()      TRISCbits.TRISC2 = 0
            #define DisplaySetCommand()         LATCbits.LATC2 = 0
            #define DisplaySetData()            LATCbits.LATC2 = 1

            // Definitions for CS pin
            #define DisplayConfig()             TRISDbits.TRISD10 = 0             
            #define DisplayEnable()             LATDbits.LATD10 = 0
            #define DisplayDisable()            LATDbits.LATD10 = 1

            // Definitions for FLASH CS pin
            #define DisplayFlashConfig()         
            #define DisplayFlashEnable()        
            #define DisplayFlashDisable()       

            // Definitions for POWER ON pin
            #define DisplayPowerConfig()        
            #define DisplayPowerOn()            
            #define DisplayPowerOff()           
        #else
        /********
         * PIC32 will use the SET and CLR SFRs for the I/O.
         * These are atomic settings that are recommended when
         * modifying SFRs
         ********/
            // Definitions for reset pin
            #define DisplayResetConfig()        TRISCCLR = _TRISC_TRISC1_MASK    
            #define DisplayResetEnable()        LATCCLR = _LATC_LATC1_MASK
            #define DisplayResetDisable()       LATCSET = _LATC_LATC1_MASK

            // Definitions for RS pin
            #define DisplayCmdDataConfig()      TRISCCLR = _TRISC_TRISC2_MASK
            #define DisplaySetCommand()         LATCCLR = _LATC_LATC2_MASK
            #define DisplaySetData()            LATCSET = _LATC_LATC2_MASK

            // Definitions for CS pin
            #define DisplayConfig()             TRISDCLR = _TRISD_TRISD10_MASK
            #define DisplayEnable()             LATDCLR = _LATD_LATD10_MASK
            #define DisplayDisable()            LATDSET = _LATD_LATD10_MASK

            // Definitions for FLASH CS pin
            #define DisplayFlashConfig()          
            #define DisplayFlashEnable()        
            #define DisplayFlashDisable()       

            // Definitions for POWER ON pin
            #define DisplayPowerConfig()        
            #define DisplayPowerOn()            
            #define DisplayPowerOff()           
        #endif
    #endif
#elif defined (MULTI_MEDIA_BOARD_DM00123)
        #ifndef __PIC32MX__
            // Definitions for reset pin
            #define DisplayResetConfig()        TRISAbits.TRISA10 = 0    
            #define DisplayResetEnable()        LATAbits.LATA10 = 0
            #define DisplayResetDisable()       LATAbits.LATA10 = 1

            // Definitions for RS pin
            #define DisplayCmdDataConfig()      TRISBbits.TRISB10 = 0
            #define DisplaySetCommand()         LATBbits.LATB10 = 0
            #define DisplaySetData()            LATBbits.LATB10 = 1

            // Definitions for CS pin
            #define DisplayConfig()             TRISGbits.TRISG13 = 0             
            #define DisplayEnable()             LATGbits.LATG13 = 0
            #define DisplayDisable()            LATGbits.LATG13 = 1

            // Definitions for FLASH CS pin
            #define DisplayFlashConfig()         
            #define DisplayFlashEnable()        
            #define DisplayFlashDisable()       

