xzcvczx/mla-legacy/Graphics MultiApp Demo/Alternative Configurations/HardwareProfile_MULTI_MEDIA_BOARD_DM00123_8PMP_PIC32_ENET_STK_SSD1926_USBMSD_TFT_G240320LTSW_118W_E.h
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD               PORTGbits.RG0
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS          TRISGbits.TRISG0
		        
		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE               PORTGbits.RG1
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS          TRISGbits.TRISG1	    
		
		// Registers for the SPI module you want to use

		// Description: The main SPI control register
		#define SPICON1             SPI2CON1
		// Description: The SPI status register
		#define SPISTAT             SPI2STAT
		// Description: The SPI Buffer
		#define SPIBUF              SPI2BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF         SPI2STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits         SPI2CON1bits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits         SPI2STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE           SPISTATbits.SPIEN

		// Tris pins for SCK/SDI/SDO lines
		// for (PIC24FJ256GA110 SPI 2)
		// Description: The TRIS bit for the SCK pin 
		#define SPICLOCK            TRISGbits.TRISG6
		// Description: The TRIS bit for the SDI pin
		#define SPIIN               TRISGbits.TRISG7
		//Description: The TRIS bit for the SDO pin
		#define SPIOUT              TRISGbits.TRISG8

	#endif

	// Will generate an error if the clock speed is too low to interface to the card
	#if (GetSystemClock() < 100000)
		#error Clock speed must exceed 100 kHz
	#endif


#endif // __HARDWARE_PROFILE_H


